serz/http.tab.objects

{"httpRequestField":"<?xml version=\"1.0\" encoding=\"UTF-8\" ?>\n<s12:Envelope xmlns:s12='http://www.w3.org/2003/05/soap-envelope'>\n  <s12:Body>\n    <ns1:GetWeather xmlns:ns1='http://www.webserviceX.NET'>\n      <ns1:CityName>Moscow</ns1:CityName>\n      <ns1:CountryName>Russia</ns1:CountryName>\n    </ns1:GetWeather>\n  </s12:Body>\n</s12:Envelope>","httpParamValueField":"","httpParamNameField":"","httpUrlField":"http://www.webservicex.com/globalweather.asmx"}